In [43]:
import pandas as pd

In [44]:
df = pd.read_excel('/Users/owner/Onedrive/Desktop/personal/Data/bible_kjv.xlsx')

df.head(2)

        id  b  c  v                                                  t
0  1001001  1  1  1  In the beginning God created the heaven and th...
1  1001002  1  1  2  And the earth was without form, and void; and ...

In [45]:
df.columns

Index(['id', 'b', 'c', 'v', 't'], dtype='object')

In [46]:
df.dtypes

id     int64
b      int64
c      int64
v      int64
t     object
dtype: object

In [47]:
df['b']=pd.to_numeric(df['b']).astype(object)
df.dtypes

id     int64
b     object
c      int64
v      int64
t     object
dtype: object

In [48]:
rename_columns = {'b':'book',
                 'c':'chapter',
                 'v':'verse',
                 't':'text'}

df.rename(columns = rename_columns, inplace=True)
df.head(2)

,id,book,chapter,verse,text
0,1001001,1,1,1,In the beginning God created the heaven and th...
1,1001002,1,1,2,"And the earth was without form, and void; and ..."

In [49]:
df_books = pd.read_excel('/Users/owner/Onedrive/Desktop/personal/Data/bible_books.xlsx')

df_books.head()

   book    book_name
0     1      Genesis
1     2       Exodus
2     3    Leviticus
3     4      Numbers
4     5  Deuteronomy

In [53]:
df_bible = pd.merge(df,df_books,on='book',how='left')
df_bible.head(2)

,id,book,chapter,verse,text,book_name
0,1001001,1,1,1,In the beginning God created the heaven and th...,Genesis
1,1001002,1,1,2,"And the earth was without form, and void; and ...",Genesis

In [ ]:
new_column_order = ['id','book','book_name','chapter','verse','text']

df_bible[new_column_order]